In [1]:
from pyspark.sql import Row, SparkSession

In [2]:
spark = SparkSession.builder.appName("test").master("local[*]").getOrCreate()

In [3]:
columns = Row("id", "name", "fee", "venue", "duration")

#Getting distinct rows from DataFrame
df = spark.sparkContext.parallelize([
    columns(1, "Hadoop", 6000, "Mumbai", 5),
    columns(2, "Spark", 5000, "Pune", 4),
    columns(3, "Python", 4000, "Hyderabad", 3),
    columns(4, "Scala", 4000, "Kolkata", 3),
    columns(5, "HBase", 7000, "Banglore", 7),
    columns(6, "Scala", 4000, "Kolkata", 3),
    columns(7, "HBase", 7000, "Banglore", 7)]).toDF()

In [4]:
df.show()

+---+------+----+---------+--------+
| id|  name| fee|    venue|duration|
+---+------+----+---------+--------+
|  1|Hadoop|6000|   Mumbai|       5|
|  2| Spark|5000|     Pune|       4|
|  3|Python|4000|Hyderabad|       3|
|  4| Scala|4000|  Kolkata|       3|
|  5| HBase|7000| Banglore|       7|
|  6| Scala|4000|  Kolkata|       3|
|  7| HBase|7000| Banglore|       7|
+---+------+----+---------+--------+

In [5]:
df2= spark.sparkContext.parallelize([
    columns(1, "Hadoop", 6000, "Mumbai", 5),
    columns(2, "Spark", 5000, "Pune", 4,),
    columns(3, "Python", 4000, "Hyderabad", 3)]).toDF()

In [6]:
df2.show()

+---+------+----+---------+--------+
| id|  name| fee|    venue|duration|
+---+------+----+---------+--------+
|  1|Hadoop|6000|   Mumbai|       5|
|  2| Spark|5000|     Pune|       4|
|  3|Python|4000|Hyderabad|       3|
+---+------+----+---------+--------+

# INNER JOIN

In [41]:
%time
df.join(df2, "id").show()

CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 9.3 µs
+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
+---+------+----+---------+--------+------+----+---------+--------+

# LEFT JOIN

In [19]:
df.join(df2, "id", "left").show()

+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  7| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  6| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
|  5| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
|  4| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
+---+------+----+---------+--------+------+----+---------+--------+

In [10]:
from pyspark.sql.functions import desc_nulls_first, col

In [17]:
df.alias("a").join(df2.alias("b"), "id", "left").sort(desc_nulls_first("b.duration")).show()

+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  6| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
|  7| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  4| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
|  5| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
+---+------+----+---------+--------+------+----+---------+--------+

# RIGHT JOIN

In [21]:
df.join(df2, "id", "right").show()

+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
+---+------+----+---------+--------+------+----+---------+--------+

# FULLOUTER JOIN

In [22]:
df.join(df2, "id", "fullouter").show()

+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  7| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  6| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
|  5| HBase|7000| Banglore|       7|  null|null|     null|    null|
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
|  4| Scala|4000|  Kolkata|       3|  null|null|     null|    null|
+---+------+----+---------+--------+------+----+---------+--------+

# BROADCAST JOIN

In [25]:
from pyspark.sql.functions import broadcast

In [33]:
%time
df.join(broadcast(df2), "id").show()

CPU times: user 0 ns, sys: 0 ns, total: 0 ns
Wall time: 7.63 µs
+---+------+----+---------+--------+------+----+---------+--------+
| id|  name| fee|    venue|duration|  name| fee|    venue|duration|
+---+------+----+---------+--------+------+----+---------+--------+
|  1|Hadoop|6000|   Mumbai|       5|Hadoop|6000|   Mumbai|       5|
|  2| Spark|5000|     Pune|       4| Spark|5000|     Pune|       4|
|  3|Python|4000|Hyderabad|       3|Python|4000|Hyderabad|       3|
+---+------+----+---------+--------+------+----+---------+--------+